import random
import os

menu = """
=======================================================================================================   
=======================================================================================================
     _______                 _______  _        _______  _______  _______  _                _______ 
   |/      |       |\     /|(  ___  )( (    /|(  ____ \(       )(  ___  )( (    /|       |/      |   
   |      (_)      | )   ( || (   ) ||  \  ( || (    \/| () () || (   ) ||  \  ( |       |      (_)
   |      \|/      | (___) || (___) ||   \ | || |      | || || || (___) ||   \ | |       |      \|/ 
   |       |       |  ___  ||  ___  || (\ \) || | ____ | |(_)| ||  ___  || (\ \) |       |       | 
   |      / \      | (   ) || (   ) || | \   || | \_  )| |   | || (   ) || | \   |       |      / \ 
   |               | )   ( || )   ( || )  \  || (___) || )   ( || )   ( || )  \  |       | 
  _|___            |/     \||/     \||/    )_)(_______)|/     \||/     \||/    )_)      _|___ 
    
                                ╔═════════════════════════════════════╗ 
                                  Desarrollado por Carlos Valencia 🦊  
                                ╚═════════════════════════════════════╝ 
=======================================================================================================
=======================================================================================================                                      

Bienvenido al juego del ahorcado!!!
En este juego tendrás que adivinar la palabra que la computadora elegió al azar.
Tendrás 7 intentos para adivinar 🤞🏽
Buena suerte 🍀
"""
def selected_word():
    replacements = (
            ("á", "a"),
            ("é", "e"),
            ("í", "i"),
            ("ó", "o"),
            ("ú", "u"),
        )
    with open("./archivos/data.txt", "r", encoding="utf-8") as f:
        words = [i.replace("\n", "") for i in f]
    
    word_selected = random.choice(words)
    for a, b in replacements:
        word_selected = word_selected.replace(a, b)
    return word_selected


def run():
    selected_word()


if __name__ == "__main__":
    run()